#include <iostream>
using namespace std;
//ѕрототип функции.
long summa(int, ...);
void main()
{
	cout << "\n summa(2,4,6)=" << summa(2, 4, 6);

	cout << "\n summa(6,1,2,3,4,5,6)=" << summa(6, 1, 2, 3, 4, 5, 6);

}
//ѕередаем количество параметров.
long summa(int k, ...)
{
	//pk содержит адрес расположени€ 
	//начала списка параметров.
	//это св€зано с тем, что параметры
	//располагаютс€ по пор€дку
	//в оперативной пам€ти
	int *pk = &k;

	//подсчет суммы
	//к - количество параметров
	long sm = 0;
	for (; k; k--)
		sm += *(++pk);

	return sm;
}
